Revit 2027 API
ImageInstance.LockProportions Property
 When true the proportion of Width to Height will be maintained
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool LockProportions { get; set; }
Public Property LockProportions As Boolean
	Get
	Set
public:
property bool LockProportions {
	bool get ();
	void set (bool value);
}
member LockProportions : bool with get, set
Property Value
Boolean
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace